"""
Задача 2: Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |
"""
numb = int(input("Введите число "))
otvet= (numb%10)+((numb//10)%10)+(numb//10//10)
print(otvet)

